Revit 2027 API
BuiltInFailures.MechanicalFailures.LiningThicknessIsLargeForHeight Property
 Lining Thickness ([Lining Thickness Value]) is too large for current Height ([Height Value]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LiningThicknessIsLargeForHeight { get; }
Public Shared ReadOnly Property LiningThicknessIsLargeForHeight As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LiningThicknessIsLargeForHeight {
	FailureDefinitionId^ get ();
}
static member LiningThicknessIsLargeForHeight : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MechanicalFailures Class
Autodesk.Revit.DB Namespace